package Z_0019_Netty入门IO通讯.S8_Netty实现登录;

public class P10_编排运行 {

    /**
     * 端口[8000]绑定成功!
     * 客户端: Mon Mar 22 22:22:02 CST 2021: 我要准备登录了!
     * 服务端: 接收到来自客户端连接时发送的数据：{"姓名":"root","密码":"root","版本号":1,"用户名":"root"}
     * 客户端: 收到服务端返回消息, {"是否成功":"失败","消息":"登录失败！","版本号":2}
     * 客户端: Mon Mar 22 22:22:02 CST 2021: 解析后说我因为密码错误重新登录
     * 服务端: 接收到来自客户端连接时发送的数据：{"姓名":"admin","密码":"admin","版本号":1,"用户名":"admin"}
     * 客户端: 收到服务端返回消息, {"是否成功":"成功","消息":"登录成功！","版本号":2}
     * 客户端: Mon Mar 22 22:22:02 CST 2021: 解析后, 我终于登录成功啦!
     */
    public static void main(String[] args) {
        P1_服务端.运行();
        P2_客户端.运行();
    }
}
