package D_07_装饰者模式;

public class C3_做好奶茶_装饰者模式 {

    public static void main(String[] args) {
        C1_奶茶 港式奶茶 = new C1_港式奶茶_被装饰者();
        港式奶茶.原料();
        港式奶茶.价格();
        System.out.println("-------------------------------------");
        // 加料
        C1_奶茶 抹茶港式奶茶 = new C2_抹茶粉_具体装饰者(港式奶茶);
        抹茶港式奶茶.原料();
        抹茶港式奶茶.价格();
        System.out.println("-------------------------------------");
        // 加料
        C1_奶茶 抹茶珍珠港式奶茶 = new C2_珍珠_具体装饰者(抹茶港式奶茶);
        抹茶珍珠港式奶茶.原料();
        抹茶珍珠港式奶茶.价格();
    }
}
